## `Plan Result Of cloudrun`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.google_iam_policy.noauth: Refreshing state...
data.google_project.my_project: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.this will be created
  + resource "google_cloud_run_service" "this" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-west1"
      + name                       = "mintaklinebot"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "cloud.googleapis.com/location" = "us-west1"
              + "environment"                   = "production"
              + "tier"                          = "backend"
            }
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "3"
                  + "run.googleapis.com/client-name"   = "terraform"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 30

              + containers {
                  + image = "gcr.io/cloudrun/hello"

                  + env {
                      + name  = "PROJECT_ID"
                      + value = "mintak"
                    }
                  + env {
                      + name  = "SECRET_TYPE"
                      + value = "GOOGLE_SECRET_MANAGER"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = {
                          + "cpu"    = "1"
                          + "memory" = "128Mi"
                        }
                      + requests = {
                          + "cpu"    = "1"
                          + "memory" = "128Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-west1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "mintaklinebot"
    }

  # google_container_registry.registry will be created
  + resource "google_container_registry" "registry" {
      + bucket_self_link = (known after apply)
      + id               = (known after apply)
      + location         = "US"
      + project          = "mintak"
    }

  # google_project_iam_member.cloud_run_secret_access_role will be created
  + resource "google_project_iam_member" "cloud_run_secret_access_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "mintak"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_service.project[0] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "iam.googleapis.com"
    }

  # google_project_service.project[1] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "containerregistry.googleapis.com"
    }

  # google_project_service.project[2] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "run.googleapis.com"
    }

  # google_project_service.project[3] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "cloudbuild.googleapis.com"
    }

  # google_project_service.project[4] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.project[5] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "storage-component.googleapis.com"
    }

  # google_project_service.project[6] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "mintak"
      + service                    = "secretmanager.googleapis.com"
    }

  # google_secret_manager_secret.linebot_secret[0] will be created
  + resource "google_secret_manager_secret" "linebot_secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "label" = "mintaklinebot"
        }
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "CHANNEL_SECRET"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-west1"
                }
            }
        }
    }

  # google_secret_manager_secret.linebot_secret[1] will be created
  + resource "google_secret_manager_secret" "linebot_secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "label" = "mintaklinebot"
        }
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "CHANNEL_ACCESS_TOKEN"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-west1"
                }
            }
        }
    }

  # google_service_account.sa_for_cloud_run will be created
  + resource "google_service_account" "sa_for_cloud_run" {
      + account_id   = "sa-for-cloudrun-mintaklinebot"
      + description  = "Service Account For Cloud Run mintaklinebot"
      + display_name = "Service Account For Cloud Run"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.cloud_run_iam will be created
  + resource "google_service_account_iam_member" "cloud_run_iam" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:641693726393@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.cloudbuild_bucket will be created
  + resource "google_storage_bucket" "cloudbuild_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-WEST1"
      + name                        = "mintak_cloudbuild"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 90
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = false
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudbuild_bucket_storage_bucket_url = (known after apply)
  + this_cloud_run_service_status        = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @mintak21, Action: `pull_request`, Workflow: `Lint`*